apache/nuttx/arch/arm/src/nrf52/ble/nrf52_ble_connection.c
/****************************************************************************
 * arch/arm/src/chip/ble/nrf52_ble_connection.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* TODO:
 * - inhibit WFI/WFE while within connection event? otherwise TIMER would
 *   not work
 * - support md bit
 *
 * General:
 * - Kconfig: add options, check enabled resources (TIMER, RTC, PPIs)
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "nrf52_ble.h"
#include "hardware/nrf52_egu.h"
#include "hardware/nrf52_ccm.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* #define NRF52_LL_DISABLE_SUPERVISION_TIMER 1 */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void nrf52_ble_count_used_channels(uint8_t conn_id);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* BLE data packet configuration:
 * Address is four bytes (thus: 1 base address + 3 more bytes).
 * S0 is always one byte (the part of the header before the length field)
 * For an advertisement PDU, LENGTH is 6 bits followed by 2 unused bits.
 * For a data PDU, LENGTH is 5 bits with 3 unused bits.
 * The maximum packet length is set to the maximum payload excluding
 * BLE header (thus 39 - 2 = 37 bytes).
 *
 * NOTE: LENGTH and S1 will be stored in two separate bytes in memory by
 * the RADIO peripheral. Thus, the buffer will require an extra byte than
 * usual and upon receiving/transmitting this will have to be fixed to build
 * a proper PDU header.
 */

/* Data packet configuration */

const struct nrf52_radio_pktcfg_s g_ble_data_pkt_config =
{
  .max_len  = BLUETOOTH_LE_PDU_MAXSIZE - 2, /* Maximum length of payload */
  .stat_len = 0,
  .bal_len  = 3,                            /* 4 bytes (3 base + 1) address length */
  .s0_len   = 1,                            /* S0 field (bytes) */
  .lf_len   = 5,                            /* LENGTH field (bits) */
  .s1_len   = 3,                            /* S1 field (bits) */
  .pl_len   = RADIO_PCNF0_PLEN_8BIT,        /* 8 bit preamble */
  .endian   = RADIO_PCNF1_ENDIAN_LITTLE,    /* LSB first on air */
  .whiteen  = true,                         /* Enable packet whitening */
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int nrf52_ble_start_connection(struct bt_adv_pdu_hdr_s *hdr,
                               struct bt_connect_req_pdu_payload_s *payload,
                               uint8_t role)
{
  struct nrf52_ble_conn_s *conn;
  int conn_slot;

  /* Master not supported yet */

  ASSERT(role != BT_LL_ROLE_MASTER);

  /* Check if there's an available slot for a new connection
   *
   * NOTE: a slave would be only connected to a single master and until we
   * support simultaneous multiple roles, the following should always
   * return the first slot as free.
   */

  for (conn_slot = 0; conn_slot < BLE_MAX_CONNECTIONS; conn_slot++)
    {
      if (!g_ble_dev.connections[conn_slot].used)
        {
          /* found an unused one, clear it and mark it used */

          memset(&g_ble_dev.connections[conn_slot], 0,
                 sizeof(struct nrf52_ble_conn_s));

          g_ble_dev.connections[conn_slot].used = true;
          break;
        }
    }

  if (conn_slot == BLE_MAX_CONNECTIONS)
    {
      return -ENOSPC;
    }

  conn = &g_ble_dev.connections[conn_slot];

  /* Disable all RADIO interrupts */

  putreg32(0xffffffff, NRF52_RADIO_INTENCLR);

  /* RADIO is RXIDLE, DISABLE until connection interval starts */

  putreg32(0, NRF52_RADIO_SHORTS);
  putreg32(0x1, NRF52_RADIO_TASKS_DISABLE);

  /* Stop main RTC instance for now. RTC2 already started measuring start of
   * connection event and we'll continue using it for the same purpose.
   */

  NRF52_RTC_STOP(g_ble_dev.rtc);
  NRF52_RTC_CLEAR(g_ble_dev.rtc);

  /* Disable all RTC interrupts */

  putreg32(0xffffffff, (BLE_RTC_BASE + NRF52_RTC_INTENCLR_OFFSET));
  putreg32(0xffffffff, (BLE_RTC2_BASE + NRF52_RTC_INTENCLR_OFFSET));

  /* Leave everything ACKd */

  NRF52_RTC_ACKINT(g_ble_dev.rtc, NRF52_RTC_EVT_COMPARE0);
  NRF52_RTC_ACKINT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE0);
  NRF52_RTC_ACKINT(g_ble_dev.rtc, NRF52_RTC_EVT_COMPARE1);
  NRF52_RTC_ACKINT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE1);
  NRF52_RTC_ACKINT(g_ble_dev.rtc, NRF52_RTC_EVT_COMPARE2);
  NRF52_RTC_ACKINT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE2);
  NRF52_RTC_ACKINT(g_ble_dev.rtc, NRF52_RTC_EVT_COMPARE3);
  NRF52_RTC_ACKINT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE3);

