apache/nuttx/arch/arm/src/nrf52/ble/nrf52_ble_connection.c
  /* Disable PPIs used during advertising */

  nrf52_ppi_channel_enable(0, false);
  nrf52_ppi_channel_enable(1, false);

  /* Enable reception for this access address (and ensure advertising access
   * address (number 0) is disabled). We use logical addresses 4-7
   * (those without conflicts between each other, as other ones share parts)
   * from the RADIO.
   */

  modifyreg32(NRF52_RADIO_RXADDRESSES, 1, 1 << (conn_slot + 4));

  g_radio_dev->ops->addr_set(g_radio_dev, conn_slot + 4,
                             payload->aa >> 24, payload->aa << 8);

  /* Set CRC data for this connection */

    {
      uint32_t crcinit = payload->crcint[0] | payload->crcint[1] << 8 |
                         payload->crcint[2] << 16;

      putreg32(crcinit, NRF52_RADIO_CRCINIT);
    }

  /* Send packets with the same access address */

  putreg32(conn_slot + 4, NRF52_RADIO_TXADDRESS);

  /* Setup connection */

  conn->master_sca = payload->sca;
  memcpy(conn->channel_map, payload->chm, 5);
  conn->hop_increment = payload->hop;
  conn->slave_latency = payload->latency * 1250;
  conn->conn_interval = payload->interval * 1250;
  conn->clk_acc = bt_ll_sca_to_ppm(payload->sca);
  conn->winoffset = payload->winoffset * 1250;
  conn->winsize = payload->winsize * 1250;
  conn->supervision_timeout = payload->timeout * 10000;

  /* generate security values */

  nrf52_ble_rand((uint8_t *)&conn->iv, sizeof(conn->iv));
  nrf52_ble_rand((uint8_t *)&conn->skd, sizeof(conn->skd));

  /* TODO: slave latency is not implemented, we will simply listen to every
   * event, even when master will not speak to us.
   */

  /* Set TXSN to 1 so that when master sends first packet with NESN 0 we
   * do not mistake it for a resend (since otherwise NESN == TXSN)
   */

  conn->txsn = 1;

  /* count number of used channels in channel map */

  nrf52_ble_count_used_channels(conn_slot);

  /* TODO: validate data, the other side could be malicious */

  /* Setup timers to handle expected:
   *   1. RX window start,
   *   2. channel change time.
   *
   * During connection setup, RX time is given by the definition of "transmit
   * window" from window offset + window size. For subsequent connection
   * events after this initial one, the RX window will only be defined by
   * the "widening" (given by considering own clock accuracy and the other's
   * side accuracy) around the expected anchor point (the time when we are
   * supposed to ideally expect a data packet from master).
   *
   * The channel change time is given by connection interval: every new
   * interval happens on a different channel (according to channel switching
   * logic). This interval is measured from the anchor point, which will
   * initially be given by the time the CONNECT_REQ PDU arrived (and, later
   * on, by each new data PDU from master).
   *
   * We will use the (second) RTC timer, which will reset at each anchor
   * point (and already did at the CONNECT_REQ, so it is currently counting).
   *
   * First we will set COMPARE1 (C1) to match start of window:
   *
   *   C1 = 1.25ms + offset - widening
   *
   * On compare, we will use the PPI to initiate RADIO RX and reset the RTC:
   *
   *   PPI CH1: C1 -> RADIO RXEN, RTC RESET
   *
   * The RTC reset marks our expected anchor point. We do this because
   * we may not receive that first PDU from master and we will have to use
   * this time point for subsequent connection events, until we receive
   * something.
   *
   * We will handle "closing" the window by disabling the RADIO from within
   * C0 ISR, setting C0 as:
   *
   *   C0 = window size + widening
   *
   * Note that this compare setting assumes the counter started at this
   * expected anchor. For this reason, we keep the ISR disabled
   * until C1 expires.
   *
   * In the ISRs of the RTC we will:
   *   - C1 (window open):
   *     - Set C1 = conn interval - widening (only need to do once)
   *     - Enable C0 ISR
   *     - Increment interval counter, if > 6, tear down connection
   *   - C0 (initially disabled, as it would otherwise match before C1):
   *     - Disable RADIO
   *     - Switch to next channel
   *
   * At this point timers are set to wait for the initial anchor, which
   * could not arrive after various intervals. To react to the initial PDU
   * and align to this anchor we also set:
   *
   *   - PPI CH3/4: RADIO CRCOK/ERROR -> RTC RESET (align to actual anchor) +
   *   - RADIO END ISR: set C0 = widening (only needed once)
   *
   * After this PDU arrives, setup is complete. C0 will close the RX window
   * if no packet received and C1 will reopen it (start a new event).
   * If a packet is received, once communication on this event finishes,
   * the next channel is selected.
   *
   * Finally, the supervision timer will be handled via the other RTC, since
   * it needs to keep counting for a much longer time. We will use C0
   * for this and handle it in the ISR.
   */

  /* At this point we will leave interrupts enabled preparing ourselves for
   * the next RX, to handle received data PDUs once we know the result of CRC
   * (and we need to consider even those that fail).
   */

  putreg32(0, NRF52_RADIO_EVENTS_END);
  putreg32(0, NRF52_RADIO_EVENTS_CRCOK);
  putreg32(0, NRF52_RADIO_EVENTS_CRCERROR);

  putreg32(RADIO_INT_CRCOK | RADIO_INT_CRCERROR, NRF52_RADIO_INTENSET);

    {
      /* Compute expected window start, size and widening */

      uint32_t window_start = 1250 + (uint32_t)payload->winoffset * 1250;
      uint32_t window_size = (uint32_t)payload->winsize * 1250;

      uint32_t window_widening =
          ((BLE_SCA + bt_ll_sca_to_ppm(payload->sca)) *
           window_start) / 1000000;

      /* Setup C1 (window start) */

      nrf52_ble_set_rtc_timeout(2, 1, window_start - window_widening);
      NRF52_RTC_ENABLEEVT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE1);

      /* PPI CH1: C1 -> RADIO RXEN, RTC RESET */

      nrf52_ppi_set_event_ep(1, BLE_RTC2_BASE +
                             NRF52_RTC_EVENTS_COMPARE_OFFSET(1));
      nrf52_ppi_set_task_ep(1, NRF52_RADIO_TASKS_RXEN);
      nrf52_ppi_set_task2_ep(1, BLE_RTC2_BASE +
                             NRF52_RTC_TASKS_CLEAR_OFFSET);
      nrf52_ppi_channel_enable(1, true);

      /* Setup C0 (window size) */

