apache/nuttx/arch/arm/src/nrf52/ble/nrf52_ble_connection.c
      window_widening = ((BLE_SCA + bt_ll_sca_to_ppm(payload->sca)) *
                          window_size) / 1000000;

      nrf52_ble_set_rtc_timeout(2, 0, window_size + window_widening);
      NRF52_RTC_ENABLEEVT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE0);
    }

  /* Enable C1 ISR */

  NRF52_RTC_ACKINT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE1);
  NRF52_RTC_ENABLEINT(g_ble_dev.rtc2, NRF52_RTC_EVT_COMPARE1);

  /* PPI CH3/4: RADIO CRCOK/CRCERROR -> RTC RESET + PPI CH0 DISABLE */

  nrf52_ppi_set_event_ep(3, NRF52_RADIO_EVENTS_CRCOK);
  nrf52_ppi_set_task_ep(3, BLE_RTC2_BASE + NRF52_RTC_TASKS_CLEAR_OFFSET);
  nrf52_ppi_set_task2_ep(3, 0);
  nrf52_ppi_channel_enable(3, true);

  nrf52_ppi_set_event_ep(4, NRF52_RADIO_EVENTS_CRCERROR);
  nrf52_ppi_set_task_ep(4, BLE_RTC2_BASE + NRF52_RTC_TASKS_CLEAR_OFFSET);
  nrf52_ppi_set_task2_ep(4, 0);
  nrf52_ppi_channel_enable(4, true);

#if !defined(NRF52_LL_DISABLE_SUPERVISION_TIMER)
  /* C0 for supervision timer in main RTC */

  nrf52_ble_set_rtc_timeout(1, 0, (uint32_t)payload->timeout * 10000);

  /* Reset the timer whenever a packet is received */

  nrf52_ppi_set_event_ep(5, NRF52_RADIO_EVENTS_CRCOK);
  nrf52_ppi_set_task_ep(5, BLE_RTC_BASE + NRF52_RTC_TASKS_CLEAR_OFFSET);
  nrf52_ppi_set_task2_ep(5, 0);
  nrf52_ppi_channel_enable(5, true);

  nrf52_ppi_set_event_ep(6, NRF52_RADIO_EVENTS_CRCERROR);
  nrf52_ppi_set_task_ep(6, BLE_RTC_BASE + NRF52_RTC_TASKS_CLEAR_OFFSET);
  nrf52_ppi_set_task2_ep(6, 0);
  nrf52_ppi_channel_enable(6, true);

  /* Enable interrupt, where we will abort connection on match */

  NRF52_RTC_ACKINT(g_ble_dev.rtc, NRF52_RTC_EVT_COMPARE0);
  NRF52_RTC_ENABLEINT(g_ble_dev.rtc, NRF52_RTC_EVT_COMPARE0);

  /* Start counting */

  NRF52_RTC_START(g_ble_dev.rtc);
#endif

  /* We also setup our own shortcuts using PPI, since RADIO shortcuts
   * can also be disabled/enabled by register writes and PPI can use events.
   * We needs this since we would like READY->START but only for RXEN and
   * not TXEN, and the RADIO shortcuts do not distinguish this.
   * We thus make this shortcut auto-disable itself to happen only
   * when we want.
   */

  nrf52_ppi_set_event_ep(7, NRF52_RADIO_EVENTS_READY);
  nrf52_ppi_set_task_ep(7, NRF52_RADIO_TASKS_START);
  nrf52_ppi_set_task2_ep(7, NRF52_PPI_TASK_CHGDIS(1));
  nrf52_ppi_grp_clear(1);
  nrf52_ppi_grp_channel_enable(1, 7, true);

  /* We leave this enabled so that once the connection event starts via
   * timer, we start RX after ramp-up. After that this shortcut will be
   * disabled.
   */

  nrf52_ppi_grp_enable(1, true);

  /* We set a second shortcut to go from RX to TX so that right after
   * receiving we have TX already ramped up to send the response (always
   * required by the slave, even if CRC fails). The RADIO supports this
   * shortcut but it requires to be END->DISABLE->TXEN which we do not want,
   * we will do END->TXEN directly. We also want this only for RX->TX so this
   * again auto disables itself.
   */

  nrf52_ppi_set_event_ep(8, NRF52_RADIO_EVENTS_END);
  nrf52_ppi_set_task_ep(8, NRF52_RADIO_TASKS_TXEN);
  nrf52_ppi_set_task2_ep(8, NRF52_PPI_TASK_CHGDIS(2));
  nrf52_ppi_grp_clear(2);
  nrf52_ppi_grp_channel_enable(2, 8, true);

  /* We leave this enabled because the first END will be from the received
   * packet.
   */

  nrf52_ppi_grp_enable(2, true);

  /* Finally, we need to ensure that we will send the response 150uS
   * (T_IFS) after packet received from master. To do so, we setup a timer
   * to trigger the START of TX. Note that this means that we have a fixed
   * ammount of time to prepare the response right after reception.
   */

  /* We start the TIMER right after a message is received */

  nrf52_ppi_set_event_ep(9, NRF52_RADIO_EVENTS_END);
  nrf52_ppi_set_task_ep(9, BLE_TIM_BASE + NRF52_TIM_TASKS_START_OFFSET);
  nrf52_ppi_set_task2_ep(9, 0);
  nrf52_ppi_channel_enable(9, true);

  /* The timer is configured to expire after T_IFS (150uS), via COMPARE0 */

  NRF52_TIM_SETCC(g_ble_dev.tim, 0, 140); /* there appears to be some 10us overhead somewhere */
  NRF52_TIM_CLEAR(g_ble_dev.tim);

  /* Now set the action that will trigger the TX start on COMPARE0 */

  nrf52_ppi_set_event_ep(10, BLE_TIM_BASE +
                         NRF52_TIM_EVENTS_COMPARE_OFFSET(0));
  nrf52_ppi_set_task_ep(10, NRF52_EGU0_TASKS_TRIGGER0);
  nrf52_ppi_set_task2_ep(10, 0);

  /* We want this to work only between RX->TX and not after TX so after
   * it fires we disable the PPI channel
   */

  nrf52_ppi_grp_clear(3);
  nrf52_ppi_grp_channel_enable(3, 10, true);

  /* We will enable this right after preparing a response so we now we're
   * sending a valid one. Thus, leave the group disabled
   */

  nrf52_ppi_grp_enable(3, false);

  /* We use this intermediary event from the EGU so that we can know
   * if it fired by checking the EGU event later
   */

  nrf52_ppi_set_event_ep(11, NRF52_EGU0_EVENTS_TRIGGERED0);
  nrf52_ppi_set_task_ep(11, NRF52_PPI_TASK_CHGDIS(3));
  nrf52_ppi_set_task2_ep(11, NRF52_RADIO_TASKS_START);
  nrf52_ppi_channel_enable(11, true);

  /* We also want to align encryption task to TX */

  nrf52_ppi_set_event_ep(12, NRF52_EGU0_EVENTS_TRIGGERED0);
  nrf52_ppi_set_task_ep(12, NRF52_CCM_TASKS_KSGEN);
  nrf52_ppi_set_task2_ep(12, 0);
  nrf52_ppi_channel_enable(12, true);

  /* ACK compare event on TIM and EGU event, so we can detect if we managed
   * to actually transmit by the time the timer expired
   */

  NRF52_TIM_ACKINT(g_ble_dev.tim, NRF52_TIM_INT_COMPARE0);
  putreg32(0, NRF52_EGU0_EVENTS_TRIGGERED0);

  /* Change state */

  g_ble_dev.state = BT_LL_STATE_CONNECTION;

  /* Set role */

  g_ble_dev.role = BT_LL_ROLE_SLAVE;

  /* Set packet pointer to our buffer, which we'll use just for RX */

  g_radio_dev->ops->set_packetptr(g_radio_dev, g_ble_dev.buffer);

  /* Choose initial data channel */

  nrf52_ble_next_data_channel(conn_slot);

  /* Inform upper layer of the new connection */

  bt_ll_on_connection(hdr, payload, BT_HCI_SUCCESS, conn_slot,
                      BT_HCI_ROLE_SLAVE);
  return OK;
}

/****************************************************************************
 * Name: nrf52_handle_data_packet
 *
 * Description:
 *   Handle a packet received in data channel (connection event)
 *
 ****************************************************************************/

void nrf52_handle_data_packet(bool crc_pass)
{
  uint8_t *active_buffer;
  struct bt_data_pdu_hdr_s *hdr_out;
  uint8_t *payload_out_ptr;
  const struct bt_data_pdu_hdr_s *hdr;
  const uint8_t *payload_ptr;
  bool resend;
  bool new_data;
  bool terminate = false;
  bool send_ack = false;
  struct nrf52_ble_conn_s *conn;

