apache/nuttx/arch/arm/src/nrf52/ble/nrf52_ble_connection.c
  conn = &g_ble_dev.connections[0];

  /* Get pointers to input data */

  hdr = (const struct bt_data_pdu_hdr_s *)g_ble_dev.buffer;
  payload_ptr = (const uint8_t *)(g_ble_dev.buffer + 3);

  /* Determine if we should resend last data and if the data we received is
   * new or if it is a resend.
   */

  resend = (hdr->nesn == conn->txsn);
  new_data = (hdr->sn == conn->nesn);

  /* We can only interpret these flags if CRC passed */

  if (crc_pass)
    {
      if (!resend)
        {
          /* last packet we sent was received, increase transmit SN */

          conn->txsn++;

          /* If last time we were sending a non-empty PDU, and encryption
           * is enabled, we should now increase the encrypted message TX
           * count since it was acked.
           */

          if (conn->encryption && conn->will_send_nonempty)
            {
              nrf52_ble_sec_inctx();
              conn->will_send_nonempty = false;
              putreg32(1, NRF52_GPIOTE_TASKS_OUT(6));
            }
        }

      /* wether we can close the connection event after this */
#if 0
      g_ble_dev.connections[0].more_data = hdr->md;
#else
      /* TODO: for now we ignore this and let the master retransmit the
       * any packet we missed inside this interval
       */

      conn->more_data = 0;
#endif
    }

  if (new_data && crc_pass)
    {
      /* increase NESN to indicate we received the packet */

      conn->nesn++;

      /* If encryption is enabled, and we're receiving a non-empty PDU,
       * increase RX encrypted count
       */

      if (conn->encryption &&
          !(hdr->llid == BT_LE_DATA_PDU1 && hdr->length == 0))
        {
          nrf52_ble_sec_incrx();
        }
    }

  if (new_data && crc_pass && hdr->llid == BT_LE_CONTROL_PDU)
    {
      /* If this is a control PDU, we will create the response ourselves */

      bool supported = true;
      bool invalid = false;

      const struct bt_control_pdu_payload_s *ctr_payload =
          (struct bt_control_pdu_payload_s *)payload_ptr;

      hdr_out = (struct bt_data_pdu_hdr_s *)g_ble_dev.ctrl_buffer;
      payload_out_ptr = g_ble_dev.ctrl_buffer + 3;

      struct bt_control_pdu_payload_s *ctr_payload_out =
          (struct bt_control_pdu_payload_s *)payload_out_ptr;

      /* process packet */

      switch (ctr_payload->opcode)
        {
          case BT_LL_CONNECTION_UPDATE_REQ:
            {
              const struct bt_control_pdu_conn_update_req_s *req =
                (const struct bt_control_pdu_conn_update_req_s *)
                    ctr_payload->ctr_data;

                if ((req->instant - conn->event_counter) % (1 << 16) >=
                    ((1 << 15) - 1))
                  {
                    /* invalid, abort connection */

                    nrf52_ble_abort_connection(0);

                    bt_ll_on_connection_closed(0, BT_HCI_ERR_INSTANT_PASSED);

                    _info("invalid channel map request, aborting\n");

                    return;
                  }
                else
                  {
                    /* Store the map and note that we will need to update
                     * it
                     */

                    conn->update_conn_params = true;
                    memcpy(&conn->next_conn_params, req, sizeof(*req));

                    /* respond with empty PDU */

                    memcpy(hdr_out, &g_empty_pdu, sizeof(g_empty_pdu));
                  }
            }
            break;
          case BT_LL_CHANNEL_MAP_REQ:
            {
              const struct bt_control_pdu_channel_map_req_s *req =
                (const struct bt_control_pdu_channel_map_req_s *)
                    ctr_payload->ctr_data;

              if ((req->instant - conn->event_counter) % (1 << 16) >=
                  ((1 << 15) - 1))
                {
                  /* invalid, abort connection */

                  nrf52_ble_abort_connection(0);

                  bt_ll_on_connection_closed(0, BT_HCI_ERR_INSTANT_PASSED);

                  _info("invalid channel map request, aborting\n");

                  return;
                }
              else
                {
                  /* store the map and note that we will need to update it */

                  conn->update_map = true;
                  memcpy(&conn->next_channel_map, req, sizeof(*req));

                  /* respond with empty PDU */

                  memcpy(hdr_out, &g_empty_pdu, sizeof(g_empty_pdu));
                }
            }
            break;
          case BT_LL_TERMINATE_IND:
            {
              terminate = true;

              /* respond with empty PDU */

              memcpy(hdr_out, &g_empty_pdu, sizeof(g_empty_pdu));
            }
            break;
          case BT_LL_FEATURE_REQ:
            {
              /* report no features for now */

              memcpy(hdr_out, hdr, sizeof(*hdr));
              ctr_payload_out->opcode = BT_LL_FEATURE_RSP;
              memset(ctr_payload_out->ctr_data, 0, 8);
              ctr_payload_out->ctr_data[0] = 1; /* encryption supported */

              memcpy(conn->remote_features, ctr_payload->ctr_data,
                     sizeof(conn->remote_features));

              conn->got_rem_features = true;
            }
            break;
          case BT_LL_VERSION_IND:
            {
              struct bt_control_pdu_version_ind_s *vers_out =
                  (struct bt_control_pdu_version_ind_s *)
                      ctr_payload_out->ctr_data;

              memcpy(hdr_out, hdr, sizeof(*hdr));

              ctr_payload_out->opcode = BT_LL_VERSION_IND;

              vers_out->versnum = BT_LL_VERSNUM_4_0;
              vers_out->subvers = 0;
              vers_out->compid = BT_LL_COMPID_NORDIC;
            }
            break;
          case BT_LL_ENC_REQ:
            {
              struct bt_control_pdu_enc_resp_s *resp =
                (struct bt_control_pdu_enc_resp_s *)
                    ctr_payload_out->ctr_data;

              /* send an ENC_RSP with our IV and SKD */

              memcpy(hdr_out, hdr, sizeof(*hdr));

              hdr_out->length = sizeof(*resp) + sizeof(uint8_t);

              ctr_payload_out->opcode = BT_LL_ENC_RSP;

