apache/nuttx/arch/arm/src/nrf52/ble/nrf52_ble_connection.c
              resp->ivs = conn->iv;
              resp->skds = conn->skd;
            }
            break;
          case BT_LL_START_ENC_RSP:
            {
              /* Send a START_ENC_RSP back */

              ctr_payload_out->opcode = BT_LL_START_ENC_RSP;

              memcpy(hdr_out, hdr, sizeof(*hdr));
            }
            break;
          default:
            invalid = true;
            break;
        }

      /* We received an invalid PDU or we simply don't support it */

      if (invalid || !supported)
        {
          memcpy(hdr_out, hdr, sizeof(*hdr));
          hdr_out->length = 2;

          if (invalid)
            {
              ctr_payload_out->opcode = BT_LL_UNKNOWN_RSP;
              ctr_payload_out->ctr_data[0] = ctr_payload->opcode;
            }
          else
            {
              ctr_payload_out->opcode = BT_LL_REJECT_IND;

              ctr_payload_out->ctr_data[0] =
                  BT_HCI_ERR_UNSUPP_REMOTE_FEATURE;
            }
        }

      if (conn->encryption)
        {
          /* when using encryption, we setup the CCM to encrypt to a separate
           * buffer which the RADIO will use during send
           */

          g_radio_dev->ops->set_packetptr(g_radio_dev,
                                          g_ble_dev.encrypted_buffer);

          nrf52_ble_sec_set_packetptr(g_ble_dev.ctrl_buffer,
                                      g_ble_dev.encrypted_buffer);
        }
      else
        {
          g_radio_dev->ops->set_packetptr(g_radio_dev,
                                          g_ble_dev.ctrl_buffer);
        }
    }
  else
    {
      active_buffer = g_ble_dev.data_buffer[g_ble_dev.active_data_buffer];

      /* We can send a data PDU */

      if (crc_pass && !resend)
        {
          hdr_out = (struct bt_data_pdu_hdr_s *)active_buffer;

          /* We do not have to resend last PDU */

          /* First we check if last sent packet was a non-empty PDU, if so
           * the controller just acked a message sent by host
           */

          if ((hdr_out->llid == BT_LE_DATA_PDU1 && hdr_out->length != 0) ||
               hdr_out->llid == BT_LE_DATA_PDU2)
            {
#if 0
              /* decrease the unacked packet count */

              DEBUGASSERT(conn->unacked_packets > 0);
              conn->unacked_packets--;
#endif

              /* inform the host */

              send_ack = true;
            }

          /* First leave an empty PDU in active buffer */

          memcpy(active_buffer,
                 (uint8_t *)&g_empty_pdu, sizeof(g_empty_pdu));

          /* Switch buffers, make the inactive active */

          g_ble_dev.active_data_buffer =
              (g_ble_dev.active_data_buffer + 1) % 2;

          active_buffer =
              g_ble_dev.data_buffer[g_ble_dev.active_data_buffer];
        }

      /* Set RADIO to use the data buffer for sending */

      if (conn->encryption)
        {
          g_radio_dev->ops->set_packetptr(g_radio_dev,
                                          g_ble_dev.encrypted_buffer);

          nrf52_ble_sec_set_packetptr(active_buffer,
                                      g_ble_dev.encrypted_buffer);
        }
      else
        {
          g_radio_dev->ops->set_packetptr(g_radio_dev, active_buffer);
        }

      /* Get pointers to output HDR and payload */

      hdr_out = (struct bt_data_pdu_hdr_s *)active_buffer;
      payload_out_ptr = active_buffer + 3;
    }

  /* Remember if the outgoing message will be a non-empty PDU */

  if ((hdr_out->llid == BT_LE_DATA_PDU1 && hdr_out->length != 0) ||
      hdr_out->llid == BT_LE_DATA_PDU2 ||
      hdr_out->llid == BT_LE_CONTROL_PDU)
    {
      conn->will_send_nonempty = true;
    }

  /* Send confirmation of packet received */

  hdr_out->nesn = conn->nesn;

  if (!resend)
    {
      /* Set sequence number of new packet */

      hdr_out->sn = conn->txsn;
    }

  /* All setup done, the TIMER will take care of initiating the send
   * at the right time, we just need to enable the action of
   * TIMER COMPARE -> TXEN. If we were late to do this, we will not have
   * sent the packet in time.
   */

  nrf52_ppi_grp_enable(3, true);

  if (terminate)
    {
      /* we will wait for the ACK to be sent right here and then
       * abort the connection
       */

      while (!getreg32(NRF52_EGU0_EVENTS_TRIGGERED0))
        {
          /* wait for TX to be issued */
        }

      while (!getreg32(NRF52_RADIO_EVENTS_END))
        {
          /* for for transmission to complete */
        }

      /* now we can abort */

      nrf52_ble_abort_connection(0);

      _info("finished connection\n");

      /* inform the host */

      bt_ll_on_connection_closed(0, BT_HCI_ERR_REMOTE_USER_TERM_CONN);

      return;
    }

  /* Now that we are all setup, we can let the host know about this */

  if (send_ack)
    {
      /* Last packet completed, report it */

      bt_ll_ack_packets(0, 1);
    }

  /* If we just send a START encryption request, mark encryption as ON */

  if (!conn->encryption && hdr_out->llid == BT_LE_CONTROL_PDU &&
      *payload_out_ptr == BT_LL_START_ENC_REQ)
    {
      conn->encryption = true;
    }

  /* Pass data on to host */

  if (crc_pass && new_data)
    {
      if ((hdr->llid == BT_LE_DATA_PDU1 && hdr->length != 0) ||
           hdr->llid == BT_LE_DATA_PDU2)
        {
          bt_ll_on_data(hdr, payload_ptr, 0);
        }
      else if (hdr->llid == BT_LE_CONTROL_PDU)
        {
          struct bt_control_pdu_payload_s *ctr_payload =
              (struct bt_control_pdu_payload_s *)payload_ptr;

          if (ctr_payload->opcode == BT_LL_FEATURE_REQ &&
              conn->req_rem_features)
            {
              bt_ll_send_rem_features(0, conn->remote_features);

              conn->req_rem_features = false;
            }
          else if (ctr_payload->opcode == BT_LL_ENC_REQ)
            {
              struct bt_control_pdu_enc_req_s *req =
                (struct bt_control_pdu_enc_req_s *)ctr_payload->ctr_data;

              /* Remember master's SKD */

              conn->skdm = req->skdm;

