apache/nuttx/arch/arm/src/nrf52/ble/nrf52_ble_connection.c
              /* Generate IV from IVs and IVm */

              nrf52_ble_sec_set_iv(conn->iv, req->ivm);

              /* Request the LTK from the host */

              bt_ll_request_ltk(0, req->ediv, req->rand);
            }
          else if (ctr_payload->opcode == BT_LL_START_ENC_RSP)
            {
              /* notify the host on encryption initiated */

              bt_ll_encryption_changed(0, true);
            }
        }
    }
}

/****************************************************************************
 * Name: nrf52_ble_send_data
 *
 * Description:
 *   Send the data supplied by the host
 *
 ****************************************************************************/

void nrf52_ble_send_data(const uint8_t *data, size_t len, bool continuation,
                         bool broadcast)
{
  irqstate_t flags;
  uint8_t *inactive_buffer;
  struct bt_data_pdu_hdr_s *hdr;
  uint8_t *payload;

  flags = enter_critical_section();

  /* Get exclusive access to inactive active buffer */

  inactive_buffer =
      g_ble_dev.data_buffer[(g_ble_dev.active_data_buffer + 1) % 2];

  /* Get pointers to header and payload */

  hdr = (struct bt_data_pdu_hdr_s *)inactive_buffer;
  payload = inactive_buffer + 3;

  /* Build header */

  hdr->llid = (continuation ? BT_LE_DATA_PDU1 : BT_LE_DATA_PDU2);
  hdr->length = len;

  /* Copy payload */

  memcpy(payload, data, len);

#if 0
  /* Increased unacked packet count */

  g_ble_dev.connections[0].unacked_packets++;
#endif

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: nrf52_ble_send_ctrl_pdu
 *
 * Description:
 *   Prepare a data PDU to be sent
 *
 ****************************************************************************/

void nrf52_ble_send_ctrl_pdu(struct bt_control_pdu_payload_s *payload,
                             size_t len)
{
  irqstate_t flags;
  uint8_t *inactive_buffer;
  struct bt_data_pdu_hdr_s *hdr;

  flags = enter_critical_section();

  /* Get exclusive access to inactive active buffer */

  inactive_buffer =
      g_ble_dev.data_buffer[(g_ble_dev.active_data_buffer + 1) % 2];

  /* Get pointer to header */

  hdr = (struct bt_data_pdu_hdr_s *)inactive_buffer;

  /* Build header */

  hdr->llid = BT_LE_CONTROL_PDU;
  hdr->length = len;

  /* Copy payload */

  memcpy(inactive_buffer + 3, payload, len);

  leave_critical_section(flags);

  _info("host send: %i\n", hdr->length);
}

/****************************************************************************
 * Name: nrf52_ble_abort_connection
 *
 * Description:
 *   Abort the connection in progress, go back to standby state
 *
 ****************************************************************************/

void nrf52_ble_abort_connection(int conn)
{
  /* Disable all RTC and RADIO interrupts */

  putreg32(0xffffffff, NRF52_RADIO_INTENCLR);
  putreg32(0xffffffff, BLE_RTC_BASE + NRF52_RTC_INTENCLR_OFFSET);
  putreg32(0xffffffff, BLE_RTC2_BASE + NRF52_RTC_INTENCLR_OFFSET);

  /* Disable all RTC events */

  putreg32(0xffffffff, BLE_RTC_BASE + NRF52_RTC_EVTENCLR_OFFSET);
  putreg32(0xffffffff, BLE_RTC2_BASE + NRF52_RTC_EVTENCLR_OFFSET);

  /* Stop TIMER and RTC */

  NRF52_RTC_STOP(g_ble_dev.rtc);
  NRF52_RTC_STOP(g_ble_dev.rtc2);
  NRF52_TIM_STOP(g_ble_dev.tim);

  /* Disable all PPIs */

  nrf52_ppi_channel_enable(1, false);
  nrf52_ppi_channel_enable(3, false);
  nrf52_ppi_channel_enable(4, false);
  nrf52_ppi_channel_enable(5, false);
  nrf52_ppi_channel_enable(6, false);
  nrf52_ppi_channel_enable(9, false);
  nrf52_ppi_channel_enable(11, false);
  nrf52_ppi_channel_enable(12, false);

  /* Disable PPI groups */

  nrf52_ppi_grp_enable(0, false);
  nrf52_ppi_grp_enable(1, false);
  nrf52_ppi_grp_enable(2, false);

  /* Clear all PPI groups */

  nrf52_ppi_grp_clear(1);
  nrf52_ppi_grp_clear(2);
  nrf52_ppi_grp_clear(3);

  /* disable the radio */

  putreg32(1, NRF52_RADIO_TASKS_DISABLE);

  /* disable encryption */

  nrf52_ble_sec_mode(BLE_SEC_DISABLE);

  nrf52_ble_sec_reset_pktctr();

  /* Disable reception for this address */

  modifyreg32(NRF52_RADIO_RXADDRESSES, 1 << (conn + 4), 0);

  /* Reset connection state */

  memset(&g_ble_dev.connections[conn], 0, sizeof(struct nrf52_ble_conn_s));

  /* Go to stanby state */

  g_ble_dev.state = BT_LL_STATE_STANDBY;
}

/****************************************************************************
 * Name: nrf52_ble_next_data_channel
 *
 * Description:
 *   Apply the data channel selection algorithm to select the next data
 *   channel for the given connection.
 *
 ****************************************************************************/

void nrf52_ble_next_data_channel(int conn_slot)
{
  uint8_t unmapped_channel;
  struct nrf52_ble_conn_s *conn = &g_ble_dev.connections[conn_slot];

  /* if there's a channel map update pending and it should be applied at
   * this connection event, copy it
   */

  if (conn->update_map &&
      conn->event_counter == conn->next_channel_map.instant)
    {
      memcpy(conn->channel_map, conn->next_channel_map.channel_map,
             sizeof(conn->channel_map));

      nrf52_ble_count_used_channels(0);

      conn->update_map = false;
    }

  /* Find an unmapped channel */

  unmapped_channel = (conn->last_unmapped_ch + conn->hop_increment) % 37;

  /* Is this channel available for this connection according to the map? */

  if (!(conn->channel_map[unmapped_channel / 8] &
        (1 << (unmapped_channel % 8))))
    {
      /* No, map it to one of the used channels */

      int i;
      uint8_t remapped_channel = 0;
      uint8_t index = unmapped_channel % conn->num_used_channels;

      /* Look for the index-th used channel */

      for (i = 0; i < 37; i++)
        {
          if (conn->channel_map[i / 8] & (1 << (i % 8)))
            {
              if (index == 0)
                {
                  remapped_channel = i;
                  break;
                }
              else
                {
                  index--;
                }
            }
        }

