apache/nuttx/arch/arm/src/nrf52/ble/nrf52_ble_connection.c
      /* choose the remapped channel */

      nrf52_ble_setchannel(remapped_channel);
    }
  else
    {
      /* choose the unmapped channel */

      nrf52_ble_setchannel(unmapped_channel);
    }

  /* remember last unmapped channel */

  g_ble_dev.connections[conn_slot].last_unmapped_ch = unmapped_channel;
}

/****************************************************************************
 * Name: nrf52_ble_count_used_channels
 *
 * Description:
 *   Count number of used channels in channel map
 *
 ****************************************************************************/

static void nrf52_ble_count_used_channels(uint8_t conn_id)
{
  int i;
  struct nrf52_ble_conn_s *conn = &g_ble_dev.connections[conn_id];

  conn->num_used_channels = 0;

  for (i = 0; i < 5; i++)
    {
      uint8_t b = conn->channel_map[i];

      while (b)
        {
          if (b & 1)
            {
              conn->num_used_channels++;
            }

          b >>= 1;
        }
    }
}

/****************************************************************************
 * Name: nrf52_ble_close_connection_event
 *
 * Description:
 *   Closes current connection event, leaving everything prepared for the
 *   next one.
 *
 ****************************************************************************/

void nrf52_ble_close_connection_event(void)
{
  struct nrf52_ble_conn_s *conn = &g_ble_dev.connections[0];

  /* Disable RADIO, no more RX until next event */

  putreg32(1, NRF52_RADIO_TASKS_DISABLE);

  /* ensure packet pointer set to RX buffer for next event */

  if (conn->encryption)
    {
      /* when using encryption, we make the RADIO write into a separate
       * buffer, which the CCM will use to decrypt into the normal I/O
       * buffer
       */

      g_radio_dev->ops->set_packetptr(g_radio_dev,
                                      g_ble_dev.encrypted_buffer);

      nrf52_ble_sec_set_packetptr(g_ble_dev.encrypted_buffer,
                                  g_ble_dev.buffer);

      /* Setup for decryption */

      nrf52_ble_sec_mode(BLE_SEC_DECRYPT);
    }
  else
    {
      g_radio_dev->ops->set_packetptr(g_radio_dev, g_ble_dev.buffer);
    }

  /* we will be starting a new connection event */

  conn->event_counter++;

  putreg32(1, NRF52_GPIOTE_TASKS_OUT(4));

  /* go to next channel */

  nrf52_ble_next_data_channel(0);

  /* Prepare for next RX and RX->TX transition
   * (rearm READY->START and END->TXEN)
   */

  nrf52_ppi_grp_enable(1, true);
  nrf52_ppi_grp_enable(2, true);

  /* Prepare to handle next RX */

  putreg32(0, NRF52_RADIO_EVENTS_CRCERROR);
  putreg32(0, NRF52_RADIO_EVENTS_CRCOK);
  putreg32(RADIO_INT_CRCERROR | RADIO_INT_CRCOK, NRF52_RADIO_INTENSET);
  putreg32(RADIO_INT_END, NRF52_RADIO_INTENCLR);

  /* ACK compare event on TIM and EGU event, so we can detect if we managed
   * to actually transmit by the time the timer expired
   */

  NRF52_TIM_ACKINT(g_ble_dev.tim, NRF52_TIM_INT_COMPARE0);
  putreg32(0, NRF52_EGU0_EVENTS_TRIGGERED0);

  /* check if we should apply new connection parameters */

  if (conn->update_conn_params &&
      conn->event_counter == conn->next_conn_params.instant)
    {
      uint32_t window_start;
      uint32_t window_widening;

      uint32_t new_interval = conn->next_conn_params.interval * 1250;
      uint32_t new_offset = conn->next_conn_params.winoffset * 1250;
      uint32_t new_size = conn->next_conn_params.winsize * 1250;
      uint32_t new_latency = conn->next_conn_params.latency;
      uint32_t new_timeout = conn->next_conn_params.timeout;

      /* compute new values */

      window_start = new_offset + (uint32_t)conn->conn_interval;

      window_widening = ((BLE_SCA + bt_ll_sca_to_ppm(conn->master_sca)) *
                          window_start) / 1000000;

      /* Setup C1 (window start) */

      nrf52_ble_set_rtc_timeout(2, 1, window_start - window_widening);

      /* Setup C0 (window end). this will be actually modified in C1 ISR */

      window_widening = ((BLE_SCA + bt_ll_sca_to_ppm(conn->master_sca)) *
                          new_size) / 1000000;

      nrf52_ble_set_rtc_timeout(2, 0, new_size + window_widening);

      /* setup supervision timer */

      nrf52_ble_set_rtc_timeout(1, 0,
                                conn->next_conn_params.timeout * 10000);

      NRF52_RTC_CLEAR(g_ble_dev.rtc);

      /* remember the settings */

      conn->conn_interval = new_interval;
      conn->winoffset = new_offset;
      conn->winsize = new_size;
      conn->slave_latency = conn->next_conn_params.latency;

      /* notify the host */

      if (new_interval != conn->conn_interval ||
          new_latency != conn->slave_latency ||
          new_timeout != conn->supervision_timeout)
        {
          bt_ll_update_conn_params(0, conn->next_conn_params.interval,
                                   conn->next_conn_params.latency,
                                   conn->next_conn_params.timeout);
        }

      conn->update_conn_params = false;
    }
}

/****************************************************************************
 * Name: nrf52_ble_get_remote_features
 *
 * Description:
 *   Called by the upper layer to request the features of the remote
 * controller
 *
 ****************************************************************************/

int nrf52_ble_get_remote_features(uint8_t conn)
{
#if 0
  if (g_ble_dev.connections[conn].got_rem_features)
    {
      bt_ll_send_rem_features(conn,
                              g_ble_dev.connections[conn].remote_features);
      _info("sent features\n");

      return OK;
    }
  else
    {
      _info("waiting for features\n");
      return -EBUSY;
    }
#else
  uint8_t features[8];
  memset(features, 0, sizeof(features));
  bt_ll_send_rem_features(conn, features);
#endif

  return 0;
}
